In [1]:
import pandas as pd

# Assignment on Pandas

## 1. Create a Datetime index containing all the weekdays days of year 2019 and assign a random number to each of them in a dataframe.

In [2]:
import numpy as np

date_rng = pd.date_range('2019-01-01', '2019-12-31', freq='D',name= 'date')

df = pd.DataFrame(date_rng)
df['num'] = np.random.randint(0,5000,size=(len(date_rng)))

df.head()

        date   num
0 2019-01-01  4413
1 2019-01-02  3367
2 2019-01-03  4276
3 2019-01-04  3915
4 2019-01-05  1123

## 2. Given Pandas series , height = [23,42,55] and weight = [71,32,48] . Create a dataframe with height and weight as column names.

In [3]:
height = [23,42,55] 
weight = [71,32,48]

df = pd.DataFrame(list(zip(height, weight)), columns =["height", "weight"])
df.head()

   height  weight
0      23      71
1      42      32
2      55      48

## 3. How to get the items of series A not present in series B .From ser1 remove items present in ser2.

ser1 = pd.Series([2, 3, 4, 5])

ser2 = pd.Series([5, 6, 7, 8])

In [4]:
ser1 = pd.Series([2, 3, 4, 5], name="num")
ser2 = pd.Series([5, 6, 7, 8], name="num")

pd.merge(ser1,ser2, indicator=True, how='outer').query('_merge=="left_only"').drop('_merge', axis=1)

   num
0    2
1    3
2    4

# Questions on Titanic Dataset :-

## 4. Compute the minimum, 25th percentile, median, 75th, and maximum of age in titanic dataset

## 5. How to get frequency counts of unique items of a series? Calculate the frequency counts of ‘SibSp’ column in titanic Dataset

## 6. Keep only top 2 most frequent values as it is and replace everything else as ‘Other’ in ‘Embarked’ column of titanic dataset

## 7.  Bin the price column in titanic data set into 5 equal groups and get counts of each bin

## 8. Count the number of missing values in each column?

## 9. Get the row number of the 5th largest value in the Age column of titanic dataset?

## 10. Normalize all columns in a dataframe?

## 11. Get the indices of items of ser2 in ser1 as a list.

ser1 = pd.Series([10, 9, 6, 5, 3, 1, 12, 8, 13])

ser2 = pd.Series([1, 3, 10, 13])

In [5]:
ser1 = pd.Series([10, 9, 6, 5, 3, 1, 12, 8, 13])
ser2 = pd.Series([1, 3, 10, 13])

ser1.index[ser1.isin(ser2) == True].tolist()

[0, 4, 5, 8]

## 12. How to convert a series of date-strings to a timeseries?

['01 Jan 2010','02-02-2011','20120303','2013/04/04','2014-05-05','2015-06-06T12:20']

In [6]:
dates = pd.to_datetime(['01 Jan 2010','02-02-2011','20120303','2013/04/04','2014-05-05','2015-06-06T12:20'])
df = pd.DataFrame(dates, columns=['date'])
df.head(10)

                 date
0 2010-01-01 00:00:00
1 2011-02-02 00:00:00
2 2012-03-03 00:00:00
3 2013-04-04 00:00:00
4 2014-05-05 00:00:00
5 2015-06-06 12:20:00

## 13. Get the day of month, week number, day of year and day of week from ser.

ser = pd.Series(['01 Jan 2010','02-02-2011','20120303','2013/04/04','2014-05-05','2015-06-06T12:20'])

In [7]:
ser = pd.Series(['01 Jan 2010','02-02-2011','20120303','2013/04/04','2014-05-05','2015-06-06T12:20'])
ser_d = pd.to_datetime(ser)

day =ser_d.dt.day
week =ser_d.dt.week
dayofyear =ser_d.dt.dayofyear
weekdayname =ser_d.dt.weekday_name

ser_d = pd.DataFrame(ser_d,columns=["date"])

ser_d["day_of_month"] = day
ser_d["week_number"] = week
ser_d["day_of_year"] = dayofyear
ser_d["day_of_week"] = weekdayname

ser_d.head(10)

                 date  day_of_month  week_number  day_of_year day_of_week
0 2010-01-01 00:00:00             1           53            1      Friday
1 2011-02-02 00:00:00             2            5           33   Wednesday
2 2012-03-03 00:00:00             3            9           63    Saturday
3 2013-04-04 00:00:00             4           14           94    Thursday
4 2014-05-05 00:00:00             5           19          125      Monday
5 2015-06-06 12:20:00             6           23          157    Saturday

## 14. Compute the euclidean distance between series (points) p and q, without using a packaged formula.

p = pd.Series([1,2,3,4,5,6,7,8,9,10])

q = pd.Series([10,9,8,7,6,5,4,3,2,1])

Desired Output

18.165

In [10]:
p = pd.Series([1,2,3,4,5,6,7,8,9,10])
q = pd.Series([10,9,8,7,6,5,4,3,2,1])

## 15. How to create a TimeSeries starting ‘2000-01-01’ and 10 weekends (saturdays/sundays)

In [9]:
from pandas.tseries.offsets import Day

date_rng = pd.date_range('2000-01-01', periods= 5, freq= 'W-SAT')
date_merged = date_rng.union(date_rng + Day(1))
date_merged.to_series().dt.weekday_name

2000-01-01    Saturday
2000-01-02      Sunday
2000-01-08    Saturday
2000-01-09      Sunday
2000-01-15    Saturday
2000-01-16      Sunday
2000-01-22    Saturday
2000-01-23      Sunday
2000-01-29    Saturday
2000-01-30      Sunday
dtype: object

## 16. Import every 50th row of BostonHousing dataset as a dataframe.